app/controllers/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "louka"], ["LIMIT", 1]]
---
  def authorize
    admin = Admin.where(username: cookies.signed[:name]).take