app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."position" ASC
---
  def index
    @categories = Category.order(:position)

SELECT "works".* FROM "works" WHERE "works"."category_id" = $1 ORDER BY "works"."position" ASC  [["category_id", 1]]
---
  def show
    @works = @category.works.order(:position)

INSERT INTO "categories" ("title", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "fsdfdffff"], ["image", "card_front.png"], ["created_at", "2018-02-08 07:58:40.152352"], ["updated_at", "2018-02-08 07:58:40.152352"]]
---
  def create
    @category = Category.new(category_info)
    if @category.save

UPDATE "categories" SET "image" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["image", "fbc_logo.png"], ["updated_at", "2018-02-08 08:00:31.364986"], ["id", 1]]
---
  def update
    if @category.update_attributes(category_info)

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
---
  def destroy
    @category.works.each do |work|
      work.destroy
    end

    # the deleted categorie's position is recorded, the category is destroyed, and THEN all higher categories are shuffled down as far as they can be shuffled down
    deleted_position = @category.position
    @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_category
    @category = Category.find(params[:id])