app/controllers/works_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @category = Category.find(params[:category_id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "works" ("title", "size", "medium", "caption", "image", "category_id", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @category = Category.find(params[:category_id])
    @work = @category.works.create(image_info)

DELETE FROM "works" WHERE "works"."id" = $1  [["id", 2]]
---
  def destroy
    id = @work.category.id

    # the deleted work's position is recorded, the work is destroyed, and THEN all highert works form the same cetegory are shuffled down as far as they can be shuffled down
    deleted_position = @work.position
    @work.destroy

UPDATE "works" SET "title" = $1, "image" = $2, "updated_at" = $3 WHERE "works"."id" = $4  [["title", "ddddddddddddddd"], ["image", "fbc_logo.png"], ["updated_at", "2018-02-08 08:13:31.837313"], ["id", 1]]
---
  def update
    old_place = @work.position
    if @work.update_attributes(image_info)

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_work
    @work = Work.find(params[:id])